In [37]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# Challenge 1

#### Open the ` Employee.csv` file and name your dataset `employee`

In [38]:
employee=pd.read_csv('Employee.csv')
employee

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean salary by department. 
##### Tip : There are 2 ways to do it. Do it both ways

In [3]:
employee.groupby(['Department']).mean()['Salary']

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

In [4]:
pd.pivot_table(employee, index = ['Department'], values="Salary")

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title

In [5]:
pd.pivot_table(employee, index = ['Department', 'Title'], values="Salary")

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [6]:
pd.pivot_table(employee, index = ['Title'], columns='Years', values="Salary")

Years         1     2     3     4     7     8
Title
VP          NaN   NaN   NaN   NaN   NaN  70.0
analyst    35.0  30.0   NaN  35.0   NaN   NaN
associate   NaN  55.0  55.0   NaN  60.0   NaN

#### We want to know the information about the mean salary and number of employees in each department and for each job title

In [7]:
pd.pivot_table(employee,index=['Department','Title'],values='Salary',aggfunc=[np.mean,len])

                       mean    len
                     Salary Salary
Department Title
HR         VP          70.0      1
           analyst     32.5      2
IT         VP          70.0      1
           analyst     32.5      2
           associate   60.0      1
Sales      associate   55.0      2

#### We want to know for each department and for each job title the Salary's median,minimum,maximum and standard deviation. Comment your results

In [8]:
pd.pivot_table(employee, index = ['Department', 'Title'], values= 'Salary', aggfunc= [np.mean, np.median, min, max, np.std])

                       mean median    min    max       std
                     Salary Salary Salary Salary    Salary
Department Title
HR         VP          70.0   70.0     70     70       NaN
           analyst     32.5   32.5     30     35  3.535534
IT         VP          70.0   70.0     70     70       NaN
           analyst     32.5   32.5     30     35  3.535534
           associate   60.0   60.0     60     60       NaN
Sales      associate   55.0   55.0     55     55  0.000000

#### Based on your comments, fill the missing values with an appropriate value

In [9]:
pd.pivot_table(employee, index = ['Department', 'Title'], values= 'Salary', aggfunc={"Salary": [np.mean, np.median, min, max, np.std]}, fill_value=0)

                      max  mean  median  min       std
Department Title
HR         VP          70  70.0    70.0   70  0.000000
           analyst     35  32.5    32.5   30  3.535534
IT         VP          70  70.0    70.0   70  0.000000
           analyst     35  32.5    32.5   30  3.535534
           associate   60  60.0    60.0   60  0.000000
Sales      associate   55  55.0    55.0   55  0.000000

#### The share holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [10]:
pd.pivot_table(employee,index=['Department'],values='Salary',aggfunc=[np.sum,len])

              sum    len
           Salary Salary
Department
HR            135      3
IT            195      4
Sales         110      2

#### For each Department and Title, we want to know the the total years of work experience and the mean salary

In [11]:
pd.pivot_table(employee, index = ['Department','Title'], values=['Years','Salary'],aggfunc={'Years':[np.sum],'Salary':[np.mean]})

                     Salary Years
                       mean   sum
Department Title
HR         VP          70.0     8
           analyst     32.5     6
IT         VP          70.0     8
           analyst     32.5     3
           associate   60.0     7
Sales      associate   55.0     5

#### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table

#### * Hint: Write a custom function*

In [52]:
# note that for the Sales department there is no max salary

def trunc_mean(x):
        if np.isnan(np.mean(x[x!=x.max()])):
            return np.mean(x)
        else:
            return np.mean(x[x!=x.max()])

In [53]:
pd.pivot_table(employee, index = ['Department'], values='Salary',aggfunc=trunc_mean)

               Salary
Department
HR          32.500000
IT          41.666667
Sales       55.000000

# Challenge 2

#### Open the ` Fitbit.csv` file and name your dataset `fitbit`

In [ ]:
fitbit = pd.read_csv("Fitbit.csv")
fitbit.head(3)

#### Explore you dataset in terms of data types and descriptive statistics
#### *Hint: Use Pandas functions from previous lectures*

In [ ]:
fitbit.dtypes

In [ ]:
fitbit.describe()

#### You suspect that there must be a linear relationship between the Minutes Very Active and the Steps. Compute the correlation between these variables.

In [ ]:
fitbit['Minutes Very Active'].corr(fitbit['Steps'])

#### Use matplotlib to visually plot Minutes Very active vs Steps. 

##### Hint : import matplotlib.pyplot as plt (See previous lessons)#####
- Use plt.scatter(x=df['col_name_1'], y=df['col_name_2'])

In [ ]:
plt.scatter(fitbit['Minutes Very Active'],fitbit['Steps'])

#### What can you say about Minute Very Active and Steps? Write a comment below

#### Your comment here
- From the scatter plot and correlation coefficient we can see that there is a correlation between Minutes very active and Steps
- As the Minute active increases, Steps increases also(positive correlation coefficient)

#### We also suspect that there must be a linear relationship between the Minutes Sedentary and the Steps. Compute the correlation between these variables.

In [ ]:
fitbit['Minutes Sedentary'].corr(fitbit['Steps'])

#### Use matplotlib to visually plot Minutes Sedentary vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [ ]:
plt.scatter(fitbit['Minutes Sedentary'],fitbit['Steps'])

#### Your comment here
- From the scatter plot and correlation coefficient we can see that there is no correlation between Minutes Sedentary and Steps
(correlation coeficient is close to zero)

#### We also suspect that there must be a linear relationship between the MinutesOfSleep and the Steps. Compute the correlation between these variables.

In [ ]:
fitbit['MinutesOfSleep'].corr(fitbit['Steps'])

#### Use matplotlib to visually plot MinutesOfSleep vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [ ]:
plt.scatter(fitbit['MinutesOfSleep'],fitbit['Steps'])

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`
column= ['Calorie burned', 'Steps','Floors','Minutes Sedentary','Minutes Very Active', 'MinutesOfSleep']

In [ ]:
cor_fit=fitbit.loc[:,['Calorie burned', 'Steps','Floors','Minutes Sedentary','Minutes Very Active', 'MinutesOfSleep']].corr()

In [ ]:
#Print cor_fit
cor_fit

#### Based on the result of the correlation matrix. What are the highly correlated features with the variable Steps?
*Hint: From the results above select the variable Steps and order your results in descending order (use Pandas sort_values function)*

In [ ]:
cor_fit['Steps'].sort_values(ascending=False)

# Challenge 3

#### Open the `Time_Grades.csv` file and name your dataset `time_grades`

In [ ]:
time_grades=pd.read_csv('Time_Grades.csv')

#### Show visually the frequency distribution of the time_grades dataset.

In [ ]:
time_grades.hist(bins=30)

#### Is there a correaltion between study time and Grade? Use both Pearson and Spearman correlation and comment your results.

In [ ]:
# # your answer here-Pearson 
time_grades['Study time'].corr(time_grades['Grade'])

In [ ]:
## your answer here-Spearman
time_grades['Study time'].corr(time_grades['Grade'],method='spearman')

#### Use matplotlib to visually plot Study time vs Grade. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [ ]:
plt.scatter(time_grades['Study time'],time_grades['Grade'])

#### Your comment here
- We have a strong correlation between time of study and grade. As time of study increases the Grade also increases.

#### Could you explain the difference between Pearson and Spearman correlation?

#### Your comment here
- Spearman correlation is a special case of Pearson. 
- The Spearman correlation coefficient is based on the ranked values for each variable
- Correlation coefficients measure linear (Pearson) or monotonic (Spearman) relationships.
- In general, in data analytics and machine learning Pearson correlation is the most used as exploring the linear relationship between variables is more critical aspect for some machine learning models